biddr_api/app/models/bid.rb

SELECT  "bids".* FROM "bids" WHERE "bids"."auction_id" = $1 ORDER BY "bids"."id" DESC LIMIT $2  [["auction_id", 1], ["LIMIT", 1]]
SELECT  "bids".* FROM "bids" WHERE "bids"."auction_id" = $1 ORDER BY "bids"."id" DESC LIMIT $2  [["auction_id", 3], ["LIMIT", 1]]
---
  def greater_than_last_bid
    if Bid.where(auction_id: auction_id).length > 0
      if offer <= Bid.where(auction_id: auction_id).last.offer