biddr_api/app/controllers/api/v1/auctions_controller.rb

INSERT INTO "auctions" ("title", "details", "ends_on", "reserved_price", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    auction = Auction.new auction_params
    auction.user = current_user
    if auction.save

SELECT "auctions".* FROM "auctions" ORDER BY "auctions"."created_at" DESC
---
  def index
    auctions = Auction.order created_at: :desc

DELETE FROM "auctions" WHERE "auctions"."id" = $1  [["id", 2]]
---
  def destroy
    auction.destroy

SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def auction
    Auction.find params[:id]