biddr_api/app/controllers/api/v1/bids_controller.rb

SELECT  "bids".* FROM "bids" WHERE "bids"."auction_id" = $1 ORDER BY "bids"."id" DESC LIMIT $2  [["auction_id", 1], ["LIMIT", 1]]
SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "bids" ("offer", "created_at", "updated_at", "auction_id", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["offer", 234], ["created_at", "2018-11-27 02:36:10.607316"], ["updated_at", "2018-11-27 02:36:10.607316"], ["auction_id", 3], ["user_id", 1]]
---
  def create
    bid = Bid.new bid_params
    bid.auction = Auction.find params[:auction_id]
    bid.user = current_user
    bid.save!